MSG_DICT = {
    #user
	10000: "请输入正确的邮箱",
	10001: "密码格式不正确",
	10002: "登陆成功",
	10003: "账号或密码错误",
	10004: "注销成功",
	10005: "验证码错误",
	10006: "昵称格式不正确",
	10007: "注册成功,开始算法之旅吧!",
	10008: "该用户已经注册",
	10009: "注册失败",
	10010: "已登陆",
	10011: "未登陆",
	10012: "昵称已存在",
    10013: "该账户已被锁定，请联系管理员",

    #系统提示
	20000: "非法操作",
	20001: "参数错误",
	20002: "获取用户信息失败,请检查浏览器Cookie是否被禁用",
	20003: "权限不足",
	20004: "参数过长",

	#admin
	30000: "添加的班级已存在",
	30001: "添加的班级失败",
	30002: "添加班级成功",

	40000: "添加课程成功",
	40001: "添加课程失败",
	40002: "课程绑定班级成功",
	40003: "课程取消绑定成功",

	#problem
	50000: "没有该类型的题目",
	50001: "上传文件失败" ,
	50002: "部分数据导入失败或者已经存在该老师，请检查以下行数的数据",
	50003: "部分数据导入失败或者已经存在该学生，请检查以下行数的数据",

	50004: "不存在测试数据",
	50005: "测试数据修改成功",
	50006: "测试数据删除成功",
	50007: "测试数据删除失败",
    50008: "30秒内只能提交一次",

    #contest
    60000: '您输入的竞赛邀请码不正确，请联系竞赛负责人。',
    60001: '添加竞赛成功！',
    60002: '添加竞赛失败',
}